{
    "latin_name": "Fuchsia boliviana Carrière var. luxurians 'Alba'",
    "main_common_name": {
        "en": "White bolivian fuchsia",
        "ru": null
    },
    "common_names": {
        "en": [],
        "ru": []
    },
    "synonyms": [
        "Fuchsia boliviana 'alba'",
        "Fuchsia 'boliviana alba'",
        "Fuchsia boliviana carrière var. luxurians 'alba'",
        "Fuchsia corymbiflora alba"
    ],
    "tags": [
        "Conservatory Greenhouse",
        "Shrubs",
        "Synonym"
    ],
    "genus_description": "Fuchsia can be deciduous or evergreen shrubs or trees, rarely perennials, with opposite or whorled leaves and usually pendent flowers with conspicuous tubular calyx, 4 spreading sepals and 4 erect petals",
    "rank": 999999,
    "size": {
        "ultimate_height": "2.5–4 metres",
        "time_to_ultimate_height": "10–20 years",
        "ultimate_spread": "1–1.5 metres"
    },
    "soil": {
        "water": null,
        "type": [
            "Chalk",
            "Clay",
            "Loam",
            "Sand"
        ],
        "moisture": [
            "Moist but well–drained",
            "Well–drained"
        ],
        "ph": [
            "Acid",
            "Alkaline",
            "Neutral"
        ]
    },
    "position": {
        "sunlight": [
            "Full sun",
            "Partial shade"
        ],
        "side": [
            "South–facing",
            "West–facing",
            "East–facing"
        ],
        "exposure": "Sheltered",
        "hardiness_zone": "H2"
    },
    "events": {
        "harvest": [],
        "planting": []
    },
    "colour_and_scent": {
        "fragrance": null,
        "spring": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [
                "Pink",
                "White"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [
                "Pink",
                "White"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        }
    },
    "toxicity": [],
    "how_to_grow": {
        "cultivation": "Ideal for growing under glass or in containers that can be brought indoors to overwinter. Ideal for growing under glass or in containers that can be brought indoors to overwinter. Grow in moist but well-drained potting compost, in bright filtered light with good ventilation. When in growth apply a liquid balanced fertiliser monthly. Keep just moist over winter. See tender fuchsia cultivation for more detailed advice but well-drained potting compost, in bright filtered light with good ventilation. When in growth apply a liquid balanced fertiliser monthly. Keep just moist over winter. See tender fuchsia cultivation for more detailed advice growing under glass or in containers that can be brought indoors to overwinter. Ideal for growing under glass or in containers that can be brought indoors to overwinter. Grow in moist but well-drained potting compost, in bright filtered light with good ventilation. When in growth apply a liquid balanced fertiliser monthly. Keep just moist over winter. See tender fuchsia cultivation for more detailed advice but well-drained potting compost, in bright filtered light with good ventilation. When in growth apply a liquid balanced fertiliser monthly. Keep just moist over winter. See tender fuchsia cultivation for more detailed advice can be grown in either a loam-based or loam-less potting compost in bright filtered light with moderate humidity and good ventilation. When in growth apply a liquid balanced fertiliser monthly. Keep just moist over winter. Overwinter indoors. See tender fuchsia cultivation for further information",
        "propagation": [
            "Softwood",
            "Semi-hardwood"
        ],
        "suggested_panting_places": [
            "Patio and container plants"
        ],
        "pruning": [
            "Pruning group 6"
        ]
    },
    "diseases_and_pests": [],
    "scientific_classification": {
        "family": "Onagraceae",
        "phylum": null,
        "classify": null,
        "order": [],
        "genus": null,
        "species": null
    },
    "botanical_details": {
        "plant_range": null,
        "foliage": "Deciduous",
        "habit": "Bushy"
    }
}