{
    "link": "https://www.rhs.org.uk/plants/119138/brassica-oleracea-(italica-group)-red-arrow/details",
    "main_name": "Brassica oleracea (Italica Group) 'Red Arrow'",
    "tags": [
        "Annual Biennial"
    ],
    "names": {},
    "size": {
        "ultimate_height": "0.5–1 metres",
        "time_to_ultimate_height": "1 year",
        "ultimate_spread": "0.1–0.5 metres"
    },
    "growing_conditions": {
        "soil": [
            "Chalk",
            "Loam",
            "Sand"
        ],
        "moisture": [
            "Well–drained"
        ],
        "ph": [
            "Alkaline",
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Full sun"
        ],
        "aspect_position": [
            "South–facing",
            "West–facing",
            "East–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H5"
    },
    "botanical_details": {
        "family": "Brassicaceae",
        "native_to_the_uk": "No",
        "foliage": "Deciduous",
        "habit": "Columnar upright",
        "genus": "Brassicas can be annual, biennial or perennial plants, most are upright with alternate, often glaucous leaves, long taproots and clusters of cross-shaped, yellow or white flowers. The genus includes a number of species bred to produce food crops, such as cabbages, turnips, mustards and oilseed rape, as well as others grown for their ornamental value",
        "name_status": "Accepted"
    },
    "how_to_grow": {
        "cultivation": "Grow in well-drained soil to avoid winter waterlogging, in full sun with shelter from winds that may rock tall stems out of the ground. Space plants 60cm (24in) apart in both directions, and support the stems with stakes once they are tall enough. Water well during dry spells to keep soil moist and help avoid bolting",
        "propagation": "Propagate by seed in spring, either directly into the soil, in pots or a seedbed to transplant, at a depth of 2cm (¾in), and later thin to the best seedlings",
        "pruning": "Plants produce a number of small shoots and flowerheads which should be picked regularly over a long period, not all at once, to ensure a supply of shoots; cut stems once they are 15–20cm (6–8in) long, before the flower buds open, harvesting the top 8–10cm (3–4in)",
        "pests": "May be susceptible to cabbage root fly, caterpillars, cabbage whitefly and mealy cabbage aphid",
        "diseases": "May be susceptible to club root, brassica downy mildew, brassica white blister and powdery mildews"
    }
}