{
    "link": "https://www.rhs.org.uk/plants/119325/daucus-carota-autumn-king-2/details",
    "main_name": "Daucus carota 'Autumn King 2'",
    "tags": [
        "Annual Biennial"
    ],
    "names": {},
    "size": {
        "ultimate_height": "0.1–0.5 metres",
        "time_to_ultimate_height": "1 year",
        "ultimate_spread": "0.1–0.5 metres"
    },
    "growing_conditions": {
        "soil": [
            "Clay",
            "Loam",
            "Sand"
        ],
        "moisture": [
            "Moist but well–drained",
            "Well–drained"
        ],
        "ph": [
            "Acid",
            "Alkaline",
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Full sun"
        ],
        "aspect_position": [
            "South–facing",
            "West–facing",
            "East–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H4"
    },
    "botanical_details": {
        "family": "Apiaceae",
        "native_to_the_uk": "No",
        "foliage": "Deciduous",
        "habit": "Columnar upright",
        "genus": "Daucus are more commonly known as wild carrot, a group of herbaceous, biennial (although not always) plants which can reach a height of between 30 to 60cm. The triangular shaped leaves are tripinnate, divided and lacy and flowers begin in pink buds, opening into small and white clustered together in dense umbels. The fruit is small, hairy and lumpy.",
        "name_status": "Accepted"
    },
    "how_to_grow": {
        "cultivation": "Grow in an open, sunny position with deeply cultivated, well-drained soil; heavy clay or stony soils may cause carrots to fork so it is best to make sure you have removed as many stones as possible and for clay soils add plenty of organic matter, such as well rotted manure. To reduce chances of harvesting forked carrots in clay soil choose a short-rooted cultivar. Keep seeds well-watered until your seedlings have emerged. You can also sow seeds in containers, especially if you select a cultivar with a shorter root. Best harvested as a maincrop from August until December. For more advice, see carrots cultivation.",
        "propagation": "Propagate by seed. Sow from April until June. To sow directly into the ground, dig over the soil to remove weeds and large stones, firm it and then rake it level. Make drills with a hoe, water the base and sow the seed. It is best to sow sparingly so you don’t have to thin the carrots too much later on as this can attract carrot fly. Cover with soil and water in.",
        "suggested_planting_locations_and_garden_types": [
            "Patio and container plants"
        ],
        "pruning": "No pruning required",
        "pests": "Roots may be susceptible to carrot fly larvae, wireworm, slugs and rodents; foliage may be affected by aphids. A barrier of fine insect mesh at least 60cm high around the beds can help prevent carrot fly laying eggs.",
        "diseases": "Generally disease-free although may be susceptible to carrot leaf blight in wet conditions during the growing season."
    }
}