{
    "id": "53275ab5-2889-41d2-b116-9a158cdaa115",
    "link": "https://www.rhs.org.uk/plants/123903/chrysanthemum-long-island-beauty-(6b)/details",
    "main_name": "Chrysanthemum 'Long Island Beauty' (6b)",
    "tags": [
        "Conservatory Greenhouse"
    ],
    "names": {
        "synonyms": [
            "Dendranthema 'Long Island Beauty'"
        ]
    },
    "size": {
        "ultimate_height": "1–1.5 metres",
        "time_to_ultimate_height": "1 year",
        "ultimate_spread": "0.5–1 metres"
    },
    "growing_conditions": {
        "soil": [
            "Loam"
        ],
        "moisture": [
            "Moist but well–drained"
        ],
        "ph": [
            "Acid",
            "Alkaline",
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [
                "White",
                "Yellow"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Full sun"
        ],
        "aspect_position": [
            "South–facing",
            "West–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H2"
    },
    "botanical_details": {
        "family": "Asteraceae",
        "native_to_the_uk": "No",
        "foliage": "Deciduous",
        "habit": "Bushy",
        "genus": "Chrysanthemum are erect woody-based perennials with aromatic, pinnately lobed leaves and flowerheads of diverse form, from late summer to late autumn",
        "name_status": "Accepted",
        "horticultural_group": "Medium-flowered Indoor Anemone flowered chrysanthemums are tender perennials with single flowerheads, the inner florets enlarged forming a dome-shaped central boss"
    },
    "how_to_grow": {
        "cultivation": "Grow in a rich, fertile, moist but well-drained soil in sun in glasshouse border or containers of John Innes Number 3 compost. Plants can be grown outdoors in summer and brought into a cool greenhouse in early September. Blooms are produced in October to November, extending into December and so need protection from frosts in a temperate or warm greenhouse. They are grown either as disbudded or non-disbudded forms. Disbuds have all of the flower buds on each shoot removed except for the terminal bud so causing a much larger bloom to be produced than is usual. Up to 6 shoots are allowed to develop per plant, each bearing a single flower. Non-disbudded chrysanthemums are permitted to develop freely, with up to 6 stems per plant, each bearing 5 or more flower heads. The central bud of each spray is removed to give a more rounded outline",
        "propagation": "Propagate by rooting softwood cuttings in loam-less potting compost at 16°C in spring. Pot on rooted cuttings in late June to early July into 23cm pots and pinch out as soon as established",
        "suggested_planting_locations_and_garden_types": [
            "Patio and container plants",
            "City and courtyard gardens",
            "Coastal",
            "Cottage and informal garden",
            "Banks and slopes",
            "Flower borders and beds"
        ],
        "pruning": "Cut back to near ground level in the autumn, before lifting and storing for the winter",
        "pests": "Aphids and leaf miners are common pests. Leaf and bud eelworms can damage stock that has not been heat-treated. Earwigs sometimes damage blooms. Capsid bug and glasshouse red spider mite are occasional pests",
        "diseases": "Chrysanthemum rust and chrysanthemum white rust, can be very damaging and hard to control. Powdery mildews can be damaging in dry conditions. In wet weather grey moulds and other fungal rots can be severe. A virus may cause stunting and leaf markings"
    }
}