{
    "id": "bd8b0801-6b34-4cb2-82e2-f79012164d49",
    "link": "https://www.rhs.org.uk/plants/165354/dendrobium-superbum-gx/details",
    "main_name": "Dendrobium Superbum gx",
    "tags": [
        "Conservatory Greenhouse",
        "Synonym"
    ],
    "names": {
        "synonyms": [
            "Dendrobium Superbum gx"
        ]
    },
    "size": {
        "ultimate_height": "0.5–1 metres",
        "time_to_ultimate_height": "5–10 years",
        "ultimate_spread": "0.5–1 metres"
    },
    "growing_conditions": {
        "soil": [],
        "moisture": [
            "Well–drained"
        ],
        "ph": [
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [
                "Pink"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green",
                "Yellow"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Partial shade",
            "Full sun"
        ],
        "aspect_position": [
            "East–facing",
            "South–facing",
            "West–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H1A"
    },
    "botanical_details": {
        "family": "Orchidaceae",
        "native_to_the_uk": "No",
        "foliage": "Deciduous",
        "habit": "Clump forming, Pendulous weeping",
        "genus": "Dendrobium are epiphytic and terrestrial orchids with elongated, stem-like pseudobulbs bearing linear to ovate leaves. Racemes or panicles of showy flowers are produced from nodes along the stems mainly in spring",
        "name_status": "Correct",
        "plant_range": "SE Asia"
    },
    "how_to_grow": {
        "cultivation": "Plants are best grown in basket or mounted on cork bark or wood if grown in conditions where sufficient humidity can be provided during the growing season. Grow in an epiphytic, medium grade, bark-based potting mix with added perlite, moss, or coir. As with many orchids, they grow best when the roots are slightly restricted. Therefore, avoid over-potting or frequent root disturbance. Provide bright, filtered light throughout the year. The average temperatures are 25-30°C during day and 16-20°C at night time, with an amplitude of 8-10°C between day and night. Plant requires frequent watering and relatively high humidity during summer months and a period of rest in winter - reduce watering and feeding in October, until warmer temperatures initiate flowering and new growth in spring. See indoor orchid cultivation",
        "propagation": "Propagation by seed is only possible in controlled laboratory environment. Mature plants may be divided when the plant overgrows the pot. Sideshoots (keiki) may develop on older canes -remove and pot them into sphagnum moss when the new roots are at least 2cm long.",
        "suggested_planting_locations_and_garden_types": [
            "Conservatory and greenhouse"
        ],
        "pruning": "No pruning required. Remove spent flowers as necessary, but do not cut the whole cane unless completely shrivelled - usually after few years of growth. Oldest canes may be removed as long as there are enough younger canes on the plant.",
        "pests": "May be susceptible to scale insects, aphids, mealybugs and red spider mite.",
        "diseases": "Generally disease-free."
    }
}