{
    "id": "b8b31358-f6bc-40c9-98ef-9ac719e93189",
    "link": "https://www.rhs.org.uk/plants/341517/dendrobium-hsinying-frosty-maree-gx/details",
    "main_name": "Dendrobium Hsinying Frosty Maree gx",
    "tags": [
        "Conservatory Greenhouse",
        "Houseplants"
    ],
    "names": {},
    "size": {
        "ultimate_height": "0.1–0.5 metres",
        "time_to_ultimate_height": "5–10 years",
        "ultimate_spread": "0.1–0.5 metres"
    },
    "growing_conditions": {
        "soil": [],
        "moisture": [
            "Well–drained"
        ],
        "ph": [
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "fragrance": "Flower",
        "spring": {
            "stem": [
                "Green",
                "Black"
            ],
            "flower": [
                "White",
                "Orange"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [
                "Green",
                "Black"
            ],
            "flower": [
                "White",
                "Orange"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [
                "Green",
                "Black"
            ],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [
                "Green",
                "Black"
            ],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Partial shade",
            "Full sun"
        ],
        "aspect_position": [
            "East–facing",
            "South–facing",
            "West–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H1B"
    },
    "botanical_details": {
        "family": "Orchidaceae",
        "native_to_the_uk": "No",
        "foliage": "Evergreen",
        "habit": "Columnar upright, Clump forming",
        "genus": "Dendrobium are epiphytic and terrestrial orchids with elongated, stem-like pseudobulbs bearing linear to ovate leaves. Racemes or panicles of showy flowers are produced from nodes along the stems mainly in spring",
        "name_status": "Accepted"
    },
    "how_to_grow": {
        "cultivation": "Plants are best grown in a pot in an epiphytic, medium grade, bark-based potting mix with added perlite, moss, or coir. It is best to stake each cane to keep the upright form when potted. If grown in a basket, the plant will develop more pendulous form. As with many orchids, they grow best when the roots are slightly restricted. Therefore, avoid over-potting or frequent root disturbance. It is a warm-growing orchid and the temperatures should not drop below 16°C. It can be grown similarly to Moth Orchid (Phalaenopsis) but requires much brighter conditions. Provide indirect light and higher humidity by misting regularly in spring and summer, then move the plant to a bright, room in autumn and winter. Water approximately once per week, ensure that roots dry-out between the waterings, especially in winter. See indoor orchid cultivation",
        "propagation": "Propagation by seed is only possible in controlled laboratory environment. Mature plants may be divided when the plant overgrows the pot. Sideshoots (keiki) may develop on older canes - remove and pot them into sphagnum moss when the new roots are at least 2cm long.",
        "suggested_planting_locations_and_garden_types": [
            "Conservatory and greenhouse"
        ],
        "pruning": "No pruning required. Remove spent flowers as necessary, but do not cut the whole cane unless completely shrivelled. Oldest canes may be removed as long as there are enough, younger, thick, leaf-bearing canes on the plant.",
        "pests": "May be susceptible to scale insects, aphids, mealybugs and red spider mite.",
        "diseases": "Generally disease-free."
    }
}