{
    "link": "https://www.rhs.org.uk/plants/409309/sarcanthus-pugioniformis/details",
    "main_name": "Sarcanthus pugioniformis",
    "tags": [
        "Conservatory Greenhouse",
        "Synonym"
    ],
    "names": {
        "synonyms": [
            "Sarcanthus pugioniformis"
        ]
    },
    "size": {
        "ultimate_height": "0.5–1 metres",
        "time_to_ultimate_height": "5–10 years",
        "ultimate_spread": "0.5–1 metres"
    },
    "growing_conditions": {
        "soil": [],
        "moisture": [
            "Well–drained",
            "Moist but well–drained"
        ],
        "ph": [
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [
                "White",
                "Yellow",
                "Green",
                "Brown"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [
                "White",
                "Yellow",
                "Green",
                "Brown"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [
                "White",
                "Yellow",
                "Green",
                "Brown"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [
                "White",
                "Yellow",
                "Green",
                "Brown"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Full sun",
            "Partial shade"
        ],
        "aspect_position": [
            "South–facing",
            "East–facing",
            "West–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H1C"
    },
    "botanical_details": {
        "family": "Orchidaceae",
        "native_to_the_uk": "No",
        "foliage": "Evergreen",
        "habit": "Trailing, Bushy",
        "name_status": "Correct",
        "plant_range": "E Himalaya"
    },
    "how_to_grow": {
        "cultivation": "For successful cultivation and frequent flowering, plants require high light levels and long, light days. In summer, they would benefit from being in a warm and bright greenhouse or conservatory, but direct, mid-day sun should be avoided. The shape of leaves may indicate the plant's light requirements. Wider, darker leaves prefer bright but indirect sunlight, while thinner or pencil-like leaves need larger amount of bright light. Darker tips of the roots are a sign of actively growing plant. High air humidity (70 -80%), good air circulation and regular misiting should be provided frequently when in active growth. In cooler climates with shorter days, plants may go dormant in winter. Misting may be reduced to avoid rots, but plants shouldn't be left dry for long periods. Ideal temperature range is 15°C in winter and up to 30°C during summer months. Plants can be grown in an open baskets, or in a coarse, bark-based epiphyte orchid mix. They are heavy feeders and require regular application of orchid fertiliser between spring and autumn",
        "propagation": "Propagation by seed is only possible in a controlled laboratory environment. Mature plants produce sideshoots (keiki) which may be removed and potted seperately, when the new roots (preferably 3 or more) are at least 2cm long",
        "suggested_planting_locations_and_garden_types": [
            "Conservatory and greenhouse"
        ],
        "pruning": "Remove spent flower stems at the base. Old, ''leggy'' plants with bare stems can be cut during their active growing season to reduce the size of the plant. Cut through the rhizome, below the new developed set of aerial roots. Lowering apical dominance by laying plant horizontally, or hanging upside down will support the growth of new roots.",
        "pests": "May be susceptible to scale insect and mealybugs. Thrips can cause damage on flowers and developing flower buds",
        "diseases": "Generally disease-free. Poor air movement may cause bacterial or fungal rots. Good hygiene practice and sterilising cutting tools prevent the spread of virus diseases"
    }
}