{
    "id": "f91778c0-6cbd-49cb-aa69-e70c41481c52",
    "link": "https://www.rhs.org.uk/plants/409674/vanda-amoena/details",
    "tags": [
        "Conservatory Greenhouse"
    ],
    "names": {},
    "size": {
        "ultimate_height": "1–1.5 metres",
        "time_to_ultimate_height": "5–10 years",
        "ultimate_spread": "0.5–1 metres"
    },
    "growing_conditions": {
        "soil": [],
        "moisture": [
            "Moist but well–drained"
        ],
        "ph": [
            "Neutral"
        ]
    },
    "colour_and_scent": {
        "spring": {
            "stem": [],
            "flower": [
                "Blue",
                "Pink"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "summer": {
            "stem": [],
            "flower": [
                "Blue",
                "Pink"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "autumn": {
            "stem": [],
            "flower": [
                "Blue",
                "Pink"
            ],
            "foliage": [
                "Green"
            ],
            "fruit": []
        },
        "winter": {
            "stem": [],
            "flower": [],
            "foliage": [
                "Green"
            ],
            "fruit": []
        }
    },
    "position": {
        "sun_position": [
            "Partial shade",
            "Full sun"
        ],
        "aspect_position": [
            "East–facing",
            "South–facing",
            "West–facing"
        ],
        "exposure": "Sheltered",
        "hardiness": "H1A"
    },
    "botanical_details": {
        "family": "Orchidaceae",
        "native_to_the_uk": "No",
        "foliage": "Evergreen",
        "habit": "Columnar upright",
        "genus": "A medium to large-sized, evergreen, tropical epiphytic orchid, valued for its large, bright-coloured, long-lasting flowers, often used by florists. As a typical example of a monopodial orchid, the new growth emerges from a central tip on a long, central rhizome, while older, lower leaves gradually drop off. Strap-shaped, green or dark-green leaves, up to 60 cm long angle out from the main stem. A characteristic feature of the plant is an impressive root system that hangs downwards at the base of the plant. New roots emerge from the central stem, following the ascending growing trend. Inflorescences emerge from axils of leaves and main stem, and carry up to 8 large, waxy, round-shaped flowers.",
        "name_status": "Unresolved"
    },
    "how_to_grow": {
        "cultivation": {
            "text": "For successful cultivation and frequent flowering, plants require high light levels and long, light days. In summer, they would benefit from being in a warm and bright greenhouse or conservatory, but direct, mid-day sun should be avoided. Highly absorbent, sponge-like roots are the principal water-storage organs. Dark green or purplish tips of the roots may be observed as a sign of actively growing plant. They are heavy feeders and require regular application of orchid fertiliser between spring and autumn. High air humidity (70 -80%), good air circulation and regular misiting should be provided frequently when in active growth. In cooler climates with shorter days, plants may go dormant in winter. Misting may be reduced to avoid rots, but plants shouldn't be left dry for long periods. Ideal temperature range is 15°C in winter and up to 30°C during summer months. Plants can be grown in an open baskets, or in a coarse, bark-based epiphyte orchid mix.",
            "link_names": [],
            "related_links": {}
        },
        "propagation": {
            "text": "Propagation by seed is only possible in a controlled laboratory environment. Mature plants produce sideshoots (keiki) which may be removed and potted separately, when the new roots (preferably 3 or more) are at least 2cm long.",
            "link_names": [],
            "related_links": {}
        },
        "suggested_planting_locations_and_garden_types": {
            "text": [
                "Conservatory and greenhouse",
                "Cut flowers"
            ],
            "link_names": [],
            "related_links": {}
        },
        "pruning": {
            "text": "Remove spent flower stems at the base. Old, ''leggy'' plants with bare stems can be cut during their active growing season to reduce the size of the plant. Cut through the rhizome, below the new developed set of aerial roots. Lowering apical dominance by laying plant horizontally, or hanging upside down will support the growth of new roots.",
            "link_names": [],
            "related_links": {}
        },
        "pests": {
            "text": "May be susceptible to scale insect and mealybugs. Thrips can cause damage on flowers and developing flower buds.",
            "link_names": [
                "Mealybugs",
                "Thrips"
            ],
            "related_links": {
                "mealybugs": "https://www.rhs.org.uk/biodiversity/mealybug",
                "thrips": "https://www.rhs.org.uk/biodiversity/thrips"
            }
        },
        "diseases": {
            "text": "Generally disease-free. Poor air movement may cause bacterial of fungal rots. Good hygiene practice and sterilising cutting tools prevent the spread of virus diseases.",
            "link_names": [
                "Virus diseases"
            ],
            "related_links": {
                "virus_diseases": "https://www.rhs.org.uk/disease/plant-viruses"
            }
        }
    },
    "main_name_original": "Vanda amoena",
    "display_name": "",
    "clear_main_name": "Vanda amoena"
}